export const INTRODUCTION =
  "مسابقه‌ی آموزشی کدوکدیل، رقابتی جذاب و فرصت‌ساز برای دانشجویان و دانش‌آموزان علاقه‌مند به علوم کامپیوتر و برنامه‌نویسی است. این مسابقه در سه سطح Senior ،Junior و Pro برگزار می‌شود. دانشجویان رشته‌های مهندسی کامپیوتر، علوم کامپیوتر، مهندسی برق، علوم ریاضی و همچنین تمامی دانشجویانی که درس مبانی برنامه‌نویسی را گذرانده‌اند و به حوزه‌ی الگوریتم علاقه‌مند هستند، امکان شرکت در این مسابقه را دارند. در این رقابت، زبان‌های برنامه‌نویسی C، C++، Java و Python توسط سیستم داوری پشتیبانی می‌شوند. پیش از آغاز مسابقه، کارگاه‌های آموزشی برگزار می‌شوند تا شرکت‌کنندگان بتوانند مهارت‌های خود را در زمینه‌ی الگوریتم تقویت کنند. مرحله‌ی اول مسابقه به صورت مجازی و مرحله‌ی دوم به صورت حضوری در دانشگاه صنعتی شریف برگزار می‌شود. شرکت در این مسابقه تنها به‌صورت تیم‌های دو نفره ممکن است. در صورتی که هم‌تیمی ندارید، می‌توانید از طریق گروه تلگرامی مخصوص شرکت‌کنندگان، هم‌تیمی مناسب خود را پیدا کنید. شرکت در مرحله‌ی انتخابی آنلاین رایگان است و تیم‌های برتر مسابقه‌ی حضوری علاوه‌بر جوایز نقدی، هدایایی نیز دریافت خواهند کرد.";

export const CURRENT_YEAR = "2025";

export const CODOCODILE_SOCIALS = [
  { name: "telegram", link: "https://t.me/codocodile" },
  { name: "linkedin", link: "https://www.linkedin.com/company/codocodile" },
  { name: "twitter", link: "https://twitter.com/codocodile" },
];

export const TIMELINE_DATA = [
  {
    date: "28 Mehr",
    title: "Start Registration",
    description:
      "شروع ثبت‌نام در سایت رویداد. همچنین پس از ثبت‌نام می‌توانید هم‌تیمی خود را انتخاب کنید.",
  },
  {
    date: "1 - 10 Aban",
    title: "Algorithmic Workshops",
    description:
      "در این دوره، ویدیوهای آموزشی متنوعی برای یادگیری الگوریتم‌ها به شرکت‌کنندگان ارائه خواهد شد. علاوه بر این، در صورت نیاز، کارگاه‌های آنلاین تعاملی نیز برگزار می‌شود تا امکان پرسش و پاسخ و تبادل نظر فراهم گردد.",
  },
  {
    date: "11 Aban",
    title: "Selection Contest",
    description:
      "مسابقه انتخابی به صورت مجازی برگزار می‌شود و تیم‌های برتر آن، به مسابقه حضوری راه پیدا می‌کنند.",
  },
  {
    date: "2 Azar",
    title: "Final Contest",
    description:
      "مسابقه نهایی به صورت حضوری در دانشکده کامپیوتر دانشگاه صنعتی شریف برگزار می‌شود. پس از این مسابقه، رتبه‌های نهایی مشخص خواهند شد و جوایزی به تیم‌های برتر اهدا می‌شود.",
  },
];

export const FAQ_DATA = [
  {
    question: "سطح‌بندی مسابقات به چه صورت است؟",
    answer:
      "مسابقات در سه سطح Junior و Senior و Pro برگزار می‌شود. سطح Junior مخصوص دانش‌آموزان، سطح Senior مخصوص دانشجویان و سطح Pro ویژه‌ی مدال‌آوران المپیاد کامپیوتر و مسابقه‌ی ICPC می‌باشد.",
  },
  {
    question: "دانشجویان چه رشته‌هایی امکان شرکت در مسابقه را دارند؟",
    answer:
      "دانشجویان رشته‌های مهندسی کامپیوتر، علوم کامپیوتر، مهندسی برق، علوم ریاضی و تمامی دانشجویانی که حداقل به یک زبان برنامه‌نویسی مسلط هستند، می‌توانند در این مسابقه شرکت کنند.",
  },
  {
    question: "از کدام زبان‌های برنامه‌نویسی می‌توان در مسابقه استفاده کرد؟",
    answer:
      "زبان‌های C، C++، Java و Python توسط سیستم‌ داوری پشتیبانی می‌شوند و شما می‌توانید از آن‌ها استفاده کنید.",
  },
  {
    question: "قبل از مسابقه کارگاه آموزشی برگزار می‌شود؟",
    answer:
      "بله، قبل از شروع مسابقه کارگاه‌های آموزشی توسط تیم کدوکدیل برگزار برگزار می‌شوند تا مهارت شما را در کدنویسی الگوریتمی افزایش دهند.",
  },
  {
    question: "مسابقه به صورت مجازی برگزار می‌شود یا حضوری؟",
    answer:
      "مسابقه دو مرحله دارد؛ مرحله‌ی اول آن در تاریخ ۱۱ آبان و به صورت مجازی برگزار می‌شود، سپس تیم‌های برتر مسابقه‌ی مجازی، در تاریخ ۲ آذر به صورت حضوری و در دانشگاه صنعتی شریف به رقابت می‌پردازند.",
  },
  {
    question: "مسابقه به صورت گروهی برگزار می‌شود یا فردی؟",
    answer: "مسابقه به صورت گروهی و در قالب تیم‌های دو نفره برگزار می‌شود.",
  },
  {
    question: "در صورت نداشتن هم‌تیمی چطور می‌توانم هم‌تیمی پیدا کنم؟",
    answer:
      "برگزارکنندگان مسابقه، گروهی تلگرامی ویژه شرکت‌کنندگان ایجاد کرده‌اند که از طریق آن می‌توانید هم‌تیمی خود را پیدا کنید.",
  },
  {
    question: "آیا به تیم‌های برتر جایزه‌ای تعلق خواهد گرفت؟",
    answer:
      "به تیم‌های برتر مسابقه حضوری علاوه بر جوایز نقدی، هدایایی نیز تقدیم خواهد شد.",
  },
];

export const SPONSOR_INTRODUCTION =
  "اسپانسر اصلی رویداد کدوکدیل، تپسی است. تپسی به عنوان یکی از بزرگترین پلتفرم‌های درخواست خودرو در ایران، با ارائه خدمات نوآورانه و استفاده از تکنولوژی‌های روز دنیا، همواره در کنار رویدادهای علمی و تکنولوژیک بوده است. تپسی با هدف حمایت از جوانان علاقه‌مند به برنامه‌نویسی و فناوری، حامی این رویداد شده است تا فرصتی برای توسعه مهارت‌های فنی و ارتباطی شرکت‌کنندگان فراهم شود.";

export const urls = {
  landing: "/",
  signIn: "/sign-in",
  signUp: "/sign-up",
  forgetPassword: "/forget-password",
  passwordReset: "/password-reset",
  panel: "/panel",
  profile: "/panel/profile",
  team: "/panel/team",
  sponsor: "/sponsor",
};

