export const FAQ_DATA = [
    {
        question:
            "سطح‌بندی مسابقات به چه صورت است؟"
        , answer:
            "مسابقات در سه سطح Junior و Senior و Pro برگزار می‌شود. سطح Junior مخصوص دانش‌آموزان، سطح Senior مخصوص دانشجویان و سطح Pro ویژه‌ی مدال‌آوران المپیاد کامپیوتر و مسابقه‌ی ICPC می‌باشد."
    },
    {
        question:
            "دانشجویان چه رشته‌هایی امکان شرکت در مسابقه را دارند؟"
        , answer:
            "دانشجویان رشته‌های مهندسی کامپیوتر، علوم کامپیوتر، مهندسی برق، علوم ریاضی و تمام دانشجویانی که درس مبانی برنامه‌نویسی را گذرانده‌اند، می‌توانند در مسابقه شرکت کنند."
    },
    {
        question:
            "از کدام زبان‌های برنامه‌نویسی می‌توان در مسابقه استفاده کرد؟"
        , answer:
            "زبان‌های C، C++، Java و Python توسط سیستم‌ داوری پشتیبانی می‌شوند و شما می‌توانید از آن‌ها استفاده کنید."
    },
    {
        question:
            "قبل از مسابقه کارگاه آموزشی برگزار می‌شود؟"
        , answer:
            "بله، قبل از شروع مسابقه کارگاه‌های آموزشی توسط تیم کدوکدیل برگزار برگزار می‌شوند تا مهارت شما را در کدنویسی الگوریتمی افزایش دهند."
    },
    {
        question:
            "مسابقه به صورت مجازی برگزار می‌شود یا حضوری؟"
        , answer:
            "مسابقه دو مرحله دارد؛ مرحله‌ی اول آن در تاریخ ۱۱ آبان و به صورت مجازی برگزار می‌شود، سپس تیم‌های برتر مسابقه‌ی مجازی، در تاریخ ۲ آذر به صورت حضوری و در دانشگاه صنعتی شریف به رقابت می‌پردازند."
    },
    {
        question:
            "مسابقه به صورت گروهی برگزار می‌شود یا فردی؟"
        , answer:
            "مسابقه به صورت گروهی و در قالب تیم‌های دو نفره برگزار می‌شود."
    },
    {
        question:
            "در صورت نداشتن هم‌تیمی چطور می‌توانم هم‌تیمی پیدا کنم؟"
        , answer:
            "برگزارکنندگان مسابقه، گروهی تلگرامی ویژه شرکت‌کنندگان ایجاد کرده‌اند که از طریق آن می‌توانید هم‌تیمی خود را پیدا کنید."
    },
    {
        question: "آیا به تیم‌های برتر جایزه‌ای تعلق خواهد گرفت؟"
        , answer:
            "به تیم‌های برتر مسابقه حضوری علاوه بر جوایز نقدی، هدایایی نیز تقدیم خواهد شد."
    }
];

