export const FAQ_DATA = [
    {
        question:
            "سطح بندی مسابقات به چه صورت است؟"
        , answer:
        "مسابقات در سه سطح Junior، Senior و Pro برگزار می‌شود. سطح Junior مخصوص دانش‌آموزان، سطح Senior مخصوص دانشجویان و سطح Pro ویژه مدال‌آوران المپیاد کامپیوتر و مسابقه ICPC می‌باشد."
    },
    {
        question:
            "دانشجویان چه رشته‌هایی امکان شرکت در مسابقه را دارند؟"
        , answer:
            "دانشجویان رشته‌های مهندسی کامپیوتر، علوم کامپیوتر، مهندسی برق، علوم ریاضی و تمام دانشجویانی که درس مبانی برنامه‌نویسی را گذرانده‌اند، می‌توانند در مسابقه شرکت کنند."
    },
    {
        question:
            "از چه زبان‌های برنامه‌نویسی‌ای می‌توان در مسابقه استفاده کرد؟"
        , answer:
            "زبان‌های C، C++، Java و Python توسط سیستم‌ داوری پشتیبانی می‌شوند و شما می‌توانید از آن‌ها استفاده کنید."
    },
    {
        question:
            "قبل از مسابقه کارگاه آموزشی برگزار می‌شود؟"
        , answer:
            "بله، قبل از شروع مسابقه کارگاه‌های آموزشی توسط تیم کدوکدیل برگزار می‌شود تا مهارت شما را در کدنویسی الگوریتمی افزایش دهد."
    },
    {
        question:
            "مسابقه به صورت مجازی برگزار می‌شود یا حضوری؟"
        , answer:
            "مسابقه دو مرحله دارد، مرحله اول آن در تاریخ ۴ آبان و به صورت مجازی برگزار می‌شود سپس تیم‌های برتر مسابقه مجازی، در تاریخ ۲ آذر به صورت حضوری و در دانشگاه صنعتی شریف به رقابت می‌پردازند."
    },
    {
        question:
            "مسابقه به صورت گروهی برگزار می‌شود یا فردی؟"
        , answer:
            "مسابقه به صورت گروهی و در قالب تیم‌های دو نفره برگزار می‌شود."
    },
    {
        question:
            "در صورت نداشتن هم‌تیمی چطور می‌توانم هم‌تیمی پیدا کنم؟"
        , answer:
            "برگزارکنندگان مسابقه، گروهی تلگرامی ویژه شرکت‌کنندگان ایجاد کرده‌اند که از طریق آن می‌توانید هم‌تیمی خود را پیدا کنید."
    },
];

