export const INTRODUCTION =
    "مسابقه‌ی آموزشی کدوکدیل، رقابتی جذاب و فرصت‌ساز برای دانشجویان و دانش‌آموزان علاقه‌مند به علوم کامپیوتر و برنامه‌نویسی است. این مسابقه در سه سطح Senior ،Junior و Pro برگزار می‌شود. دانشجویان رشته‌های مهندسی کامپیوتر، علوم کامپیوتر، مهندسی برق، علوم ریاضی و همچنین تمامی دانشجویانی که درس مبانی برنامه‌نویسی را گذرانده‌اند و به حوزه‌ی الگوریتم علاقه‌مند هستند، امکان شرکت در این مسابقه را دارند. در این رقابت، زبان‌های برنامه‌نویسی C، C++، Java و Python توسط سیستم داوری پشتیبانی می‌شوند. پیش از آغاز مسابقه، کارگاه‌های آموزشی برگزار می‌شوند تا شرکت‌کنندگان بتوانند مهارت‌های خود را در زمینه‌ی الگوریتم تقویت کنند. مرحله‌ی اول مسابقه به صورت مجازی و مرحله‌ی دوم به صورت حضوری در دانشگاه صنعتی شریف برگزار می‌شود. شرکت در این مسابقه تنها به‌صورت تیم‌های دو نفره ممکن است. در صورتی که هم‌تیمی ندارید، می‌توانید از طریق گروه تلگرامی مخصوص شرکت‌کنندگان، هم‌تیمی مناسب خود را پیدا کنید. شرکت در مرحله‌ی انتخابی آنلاین رایگان است و تیم‌های برتر مسابقه‌ی حضوری علاوه‌بر جوایز نقدی، هدایایی نیز دریافت خواهند کرد."


export const CURRENT_YEAR = "2024"

export const CODOCODILE_SOCIALS: { name: string, link: string }[] = [
    {name: "telegram", link: "https://t.me/codocodile"},
    {name: "linkedin", link: "https://www.linkedin.com/company/codocodile"},
    {name: "twitter", link: "https://twitter.com/codocodile"},
];