export const TIMELINE_DATA = [
    {
        date: "22 Mehr",
        title: "Start Registration",
        description: "شروع ثبت‌نام در سایت رویداد. همچنین پس از ثبت‌نام می‌توانید هم‌تیمی خود را انتخاب کنید."
    },
    {
        date: "26 Mehr - 2 Aban",
        title: "Algorithmic Workshops",
        description: "در این دوره، ویدیوهای آموزشی متنوعی برای یادگیری الگوریتم‌ها به شرکت‌کنندگان ارائه خواهد شد. علاوه بر این، در صورت نیاز، کارگاه‌های آنلاین تعاملی نیز برگزار می‌شود تا امکان پرسش و پاسخ و تبادل نظر فراهم گردد."
    },
    {
        date: "4 Aban",
        title: "Selection Contest",
        description: "مسابقه انتخابی به صورت مجازی برگزار می‌شود و تیم‌های برتر آن، به مسابقه حضوری راه پیدا می‌کنند."
    },
    {
        date: "2 Azar",
        title: "Final Contest",
        description: "مسابقه نهایی به صورت حضوری در دانشکده کامپیوتر دانشگاه صنعتی شریف برگزار می‌شود. پس از این مسابقه، رتبه‌های نهایی مشخص خواهند شد و جوایزی به تیم‌های برتر اهدا می‌شود."
    },
];